{
    "header": {
        "hello": "Hello!",
        "description": "I am a dedicated Industrial Engineering and Management student graduating next spring. Focused on software development, mathematical analysis and product development. Passionate about driving growth and creating value for clients. Seeking for a position in management consulting or business development from June 2025 onwards.",
        "cv": "My resume"
    },
    "content": {
        "software": "Software Development",
        "consulting": "Consulting",
        "servers": "Servers",
        "competences": "My competences",
        "photography": "Photography"
    },
    "footer": {
        "goodbye-text": "Thank you for visiting my website. I am open to all kinds of collaborations. If you have any questions, please contact me with the form on the side. Eagerly waiting for your contact!",
        "name": "name",
        "content": "content",
        "email": "email (as CC)",
        "sendmail": "Send mail"
    },
    "messages": {
        "fillAll": "Please fill all the inputs",
        "email": "Incorrect email address",
        "success": "Message sent successfully",
        "error": "Something went from with making the request"
    },
    "desc-text": {
        "content-text1": "I have a strong interest in software development, which comes from my mathematical thinking and logical reasoning skills. I like difficult puzzles and solving things. As a result, I have ended up coding in my studies, at work and in my free time. Of the languages, I'm most focused on Javascript and specifically Vue. I've also used Kotlin, Scala and Python.",
        "content-text2": "In my studies, my software background is focused on algorithms, while my hobby projects are more focused on the frontend side. My projects have included my own website, a summer cottage diary, and a pwa application that helps with sorting. In my work I have coded web-based full-stack applications. I have also used my coding skills in a CTO position in my subject organization. Projects in this role have included developing event registration software, deploying election voting software, and developing and deploying a snack buying system.",
        "content-text3": "I am interested in consulting because of its versatility. Consulting gives you the opportunity to see many different clients and sectors, and to challenge yourself in many different areas. The best thing about consulting is meeting the client's needs and seeing your handprint in the client's business.",
        "content-text4": "I have experience in consulting from two different positions. I was a junior IT consultant at Oikeat Oliot Oy, and I am currently a solutions consultant at Efecte Oy. As an IT consultant, I was responsible for implementing full-stack applications and identifying customer needs. The best part of the job was thinking about what features were needed and what is the best way to implement them. ",
        "content-text5": "At Efecte, I have been even more involved with the customer as a solution consultant. I have implemented several client projects and have been responsible for multiple clients, either alone or with other consultants. I have carried out various projects related to automation of the client's business.",
        "content-text6": "My interest in servers has taken off in early 2022 with the CTO position. One of the tasks of this position is to maintain the IT services of the subject organisation, so servers come into play in this context. During the assignment, Nginx and Apache have become very familiar. In addition, I have been able to gain an in-depth understanding of server user management and rights configuration.",
        "content-text7": "Besides servers, I have done a lot of DevOps related things. Docker is very familiar to me, and I've built CI/CD pipelines for my own projects using Github Actions. The basics of sending an image to the container registry and fetching the image to the server and restarting containers with watchtower are concepts I'm familiar with.",
        "content-text8": "Next, on the server side, I will implement a real pipeline using the container registry, where the source code is not found at all on my own server. Currently, Github Actions fetches the ssh connection to the server, pulls the latest code and restarts the containers.",
        "content-text9": "I have been very enthusiastic about photography since I was a little boy. I started out photographing card tricks and posting them on youtube. After that I moved into birding, where I have photographed about 300 different species of birds in Finland over the years. With bird photography I have participated in various competitions, although no success has come so far.",
        "content-text10": "Nowadays my photography is mainly focused on landscapes. I love Finnish nature and spend most of my free time in nature. I maintain my own photo account on Instagram with about 100 followers. There I always post the latest photos from my trips."

    }
}