{
    "header": {
        "hello": "Hei!",
        "description": "Olen tuotantotalouden maisteripoiskelija Aalto-yliopistosta. Opiskelen pääaineessa Product and Innovation Management, ja tarkoitukseni on suunnata kohti tuotejohtamisen työtehtäviä. Pidän sekä tekniikasta että taloudesta, ja intohimoni on käyttää erilaisia työkaluja luodakseni arvoa asiakkaille.",
        "cv": "Ansioluetteloni"
    },
    "content": {
        "software": "Ohjelmistokehitys",
        "consulting": "Konsultointi",
        "servers": "Palvelimet",
        "competences": "Osaamisalueeni",
        "photography": "Valokuvaus"
    },
    "footer": {
        "goodbye-text": "Kiitos että vierailit sivuillani. Olen avoin kaikenlaisille yhteistöille. Jos olet kiinnostunut yhteistyöstä, otathan yhteyttä lomakkeella. Odotan innolla yhteydenottoasi!",
        "name": "Nimi",
        "content": "Sisältö",
        "email": "Sähköposti (CC:nä)",
        "sendmail": "Lähetä"
    },
    "messages": {
        "fillAll": "Täytäthän kaikki kentät",
        "email": "Väärä sähköpostiosoite",
        "success": "Sähköposti lähetetty onnistuneesti",
        "error": "Jotain meni pieleen sähköpostin lähetyksessä"
    },
    "desc-text": {
        "content-text1": "Olen erittäin kiinnostunut ohjelmistokehityksestä, joka on lähtöisin matemaattisesta ajattelustani ja loogisestä päättelykyvystäni. Tykkään vaikeista pulmista ja asioiden ratkaisemisesta. Sen seurauksena olen päätynyt koodaamaan niin opinnoissa, työssä kuin vapaa-ajallanikin. Kielistä eniten olen keskittynyt Javascriptin ja sen ympärillä Vueen. Lisäksi olen käyttänyt Kotlinia, Scalaa ja Pythonia.",
        "content-text2": "Opinnoissani ohjelmistotaustani keskittyy algoritmeihin, kun taas vapaa-ajan projektit ovat keskittyneet enemmän frontend-puolelle. Projektejani ovat olleet muun muassa omat nettisivut, mökkipäiväkirja, ja lajittelussa auttava pwa-sovellus. Työssäni olen koodannut verkkopohjaisia full-stack -sovelluksia. Lisäksi olen käyttänyt koodaustaitojani CTO:n positiossa ainejärjestössäni. Tässä tehtävässä projekteja ovat olleet muun muassa tapahtumiin rekisteröintiohjelmiston kehittäminen, vaaliäänestysohjelmiston käyttönotto sekä namubufferin kehitys ja käyttöönotto.",
        "content-text3": "Olen kiinnostunut konsultoinnista sen monipuolisuuden takia. Konsultoinnissa pääsee näkemään monia eri asiakkaita ja aloja, sekä haastamaan itseään monella alueella. Parasta konsultoinnissa on asiakkaan tarpeiden täyttäminen ja oman käden jäljen näkyminen asiakkaan liiketoiminnassa.",
        "content-text4": "Minulla on kokemusta konsultoinnista kahdesta eri positioista. Oikeat Oliot Oy:llä olin nuorempi tietotekniikkakonsultti, ja nykyään olen ratkaisukonsultti Efecte Oy:llä. Tietotekniikkakonsulttina vastasin full-stack sovellusten toteuttamisesta sekä asiakastarpeiden selvittämisestä. Parasta työssä oli miettiä, miten ominaisuuksia tarvitaan ja miten ne kannattaisi parhaiten toteuttaa. ",
        "content-text5": "Efectellä olen toiminut ratkaisukonsulttina vielä enemmän asiakasrajapinnassa. Olen toteuttanut useita asiakasprojekteja ja olen vastuussa useista asiakkaista yksin tai muiden konsulttien kanssa. Olen toteuttanut erilaisia asiakkaan liiketoiminnan automatisointiin liittyviä projekteja.",
        "content-text6": "Kiinnostukseni palvelimia kohtaan on lähtenyt vuoden 2022 alussa CTO-position myötä. Tehtävässä yksi tehtävistä on ainejärjestön IT-palveluiden ylläpito, joten palvelimet tulevat tässä kontekstissa oleellisesti mukaan kuvaan. Tehtävän aikana Nginx ja Apache ovat tulleet erittäin tutuiksi. Lisäksi olen päässyt tutustumaan syvällisesti palvelimien käyttäjänhallintaan ja oikeuksien määrittelyyn.",
        "content-text7": "Palvelimien lisäksi olen tehnyt paljon DevOps-puolelle liittyviä asioita. Docker on minulle erittäin tuttu, ja olen rakentanut CI/CD pipelinejä omiin projekteihin Github Actionsien avulla. Perusteet kuvan lähettämisestä container registryyn ja kuvan hakeminen palvelimelle ja konttien uudelleenkäynnistys watchtowerilla ovat minulle tuttuja konsepteja.",
        "content-text8": "Seuraavaksi aion palvelinpuolella toteuttaa container registryn avulla oikean putken, jossa source koodia ei löydy ollenkaan omalta palvelimeltani. Tällä hetkellä Github Actions hakee ssh-yhteyden palvelimelle, pullaa uusimman koodin ja käynnistää kontit uudestaan.",
        "content-text9": "Olen pienestä asti ollut erittäin innostunut valokuvaamisesta. Aloitin kuvaamisen korttitemppujen kuvaamisesta ja julkaisemisesta youtubeen. Tämän jälkeen siirryin lintuharrastukseen, jossa olen kuvannut vuosien saatossa noin 300 eri lintulajia suomessa. Olen osallistunut lintukuvauksen myötä erilaisiin kilpailuihin, vaikka menestystä ei vielä tähän mennessä olekaan tullut.",
        "content-text10": "Nykyisin kuvaamiseni keskittyy ennen kaikkea maisemiin. Rakastan suomalaista luontoa, ja vietän luonnossa suurimman osan vapaa-ajastani. Ylläpidän instagramissa omaa kuvaustiliä, jolla on noin 100 seuraajaa. Tänne julkaisen aina uusimmat kuvani retkiltäni."
    }
}